---
kind: other
id: Properties.T:Autodesk.Revit.DB.DirectShapeType
source: html/ec9b281a-12e6-123b-e657-f1becafdbe7a.htm
---
# DirectShapeType Properties

The id of the assembly instance to which the element belongs.